app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')  ORDER BY release_date
---

  #Select ratings and sorting
    if params[:ratings] or params[:sort_by]
      @movies = Movie.where(:rating => params[:ratings].keys).order(params[:sort_by])

SELECT "movies".* FROM "movies"  ORDER BY release_date
---
      @movies = Movie.where(:rating => params[:ratings].keys)

    elsif params[:sort_by]
      @movies = Movie.order(params[:sort_by])